


//#Если Сервер или ТолстыйКлиентОбычноеПриложение или ТолстыйКлиентУправляемоеПриложение Тогда
	
#Область СлужебныеПроцедурыИФункции	

&ИзменениеИКонтроль("ПередНачаломРаботыСистемы")
Процедура ВКМ_ПередНачаломРаботыСистемы(Знач ОповещениеЗавершения) Экспорт
#Вставка
 ВКМ_ТелеграмВызовСервера.УстановитьНачальныеЗначенияКонстантДляТелеграм();
#КонецВставки
	ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();

	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = Новый Соответствие;
	КонецЕсли;

	ПараметрыПриложения.Вставить("СтандартныеПодсистемы.ОценкаПроизводительности.ВремяНачалаЗапуска", ВремяНачала);

	Если ОповещениеЗавершения <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ПроверитьПараметр("СтандартныеПодсистемыКлиент.ПередНачаломРаботыСистемы",
			"ОповещениеЗавершения", ОповещениеЗавершения, Тип("ОписаниеОповещения"));
	КонецЕсли;

	ВойтиВОбластьДанных();

	ДействияПередНачаломРаботыСистемы(ОповещениеЗавершения);

	Если Не ОтключенаЛогикаНачалаРаботыСистемы()
	   И Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.БазоваяФункциональностьБИП") Тогда
		Возврат;
	КонецЕсли;

	Попытка
		МодульИнтернетПоддержкаПользователейКлиентСервер =
			ОбщегоНазначенияКлиент.ОбщийМодуль("ИнтернетПоддержкаПользователейКлиентСервер");
	Исключение
		Если ОтключенаЛогикаНачалаРаботыСистемы() Тогда
			Возврат;
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;

	ВерсияБИП = МодульИнтернетПоддержкаПользователейКлиентСервер.ВерсияБиблиотеки();
	// Подключение обработчика запроса настроек клиента лицензирования
	// для корректной проверки легальности обновления.
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияБИП, "2.7.1.0") > 0 Тогда
		МодульКлиентЛицензированияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("КлиентЛицензированияКлиент");
		МодульКлиентЛицензированияКлиент.ПодключитьЗапросНастроекКлиентаЛицензирования();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
//#КонецЕсли