


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&Вместо("ОбработкаПроведения")
Процедура ВКМ_ОбработкаПроведения(Отказ, Режим)
	
	//ЗаполнитьКомпенсацииПроезда();

	ВКМ_СформироватьДвиженияОсновныеНачисления();         
//	СформироватьДвиженияДополнительныеНачисления();
	
	ВКМ_СформироватьСторноЗаписи();
	
	Движения.ВКМ_ОсновныеНачисления.Записать();   
//	Движения.ДополнительныеНачисления.Записать();

	ВКМ_СформироватьДвиженияУдержания();  
	ВКМ_СформироватьСторноЗаписиДвиженияУдержания();

	Движения.ВКМ_Удержания.Записать();   


	ВКМ_РасчитатьОклад();   
	ВКМ_РасчитатьПроцент();   
	ВКМ_РассчитатьОтпуск();


	ВКМ_РассчитатьУдержаниеНДФЛ();
	
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.ВКМ_Сотрудник КАК Сотрудник,
		|	ОсновныеНачисления.Результат КАК Результат,
		|	ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ОсновныеНачисления
		|ГДЕ
		|	ОсновныеНачисления.Регистратор = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_Удержания.ВКМ_Сотрудник,
		|	ВКМ_Удержания.Результат*(-1) ,
		|	ВКМ_Удержания.ВидРасчета,
		|	ВКМ_Удержания.ПериодРегистрации
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|ГДЕ
		|	ВКМ_Удержания.Регистратор = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ПериодРегистрации КАК ПериодРегистрации,
		|	ВТ.Сотрудник КАК Сотрудник,
		|	СУММА(ВТ.Результат) КАК Результат
		|ИЗ
		|	ВТ КАК ВТ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ.ПериодРегистрации,
		|	ВТ.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Количество()>0 Тогда 
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ВыборкаДетальныеЗаписи.ПериодРегистрации;
		Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.ВКМ_Сумма = ВыборкаДетальныеЗаписи.Результат;
		КонецЦикла;
		
	КонецЕсли;
	

	
	//// регистр ОсновныеНачисления
	//Движения.ОсновныеНачисления.Записывать = Истина;
	//Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
	//	Движение = Движения.ОсновныеНачисления.Добавить();
	//	Движение.Сторно = Ложь;
	//	Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
	//	Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
	//	Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
	//	Движение.ПериодРегистрации = ТекСтрокаОсновныеНачисления.ДатаНачала;
	//	Движение.БазовыйПериодНачало = ТекСтрокаОсновныеНачисления.ДатаНачала;
	//	Движение.БазовыйПериодКонец = ТекСтрокаОсновныеНачисления.ДатаОкончания;
	//	Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
	//	Движение.Подразделение = ТекСтрокаОсновныеНачисления.Подразделение;
	//КонецЦикла;   
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры



&Вместо("ПередЗаписью")
Процедура ВКМ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
		КонецЕсли;
	
	Если ЗначениеЗаполнено(ВКМ_Период)  тогда  
  		ВКМ_Период = НачалоМесяца(ВКМ_Период);
  	КонецЕсли;
	
	Если ВКМ_ЗаполнитьОкладСотрудников Тогда
	//Удаляем и заполняем окладом за месяц периода
		Отбор = Новый Структура;
		Отбор.Вставить("ВКМ_ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад);

		МСтрок = ВКМ_Начисления.НайтиСтроки(Отбор);
		Для Каждого Стр Из МСтрок Цикл
			ВКМ_Начисления.Удалить(Стр);
		КонецЦикла;
	
	//Выбрать сотрудников кому назначен оклад в этот месяц
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ГрафикРаботы
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период,) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_Оклад > 0";

		Запрос.УстановитьПараметр("Период", ВКМ_Период);

		РезультатЗапроса = Запрос.Выполнить();

		ВДЗ = РезультатЗапроса.Выбрать();

		Пока ВДЗ.Следующий() Цикл
			Стр = ВКМ_Начисления.Добавить();
			Стр.ВКМ_Сотрудник = ВДЗ.ВКМ_Сотрудник;
			Стр.ВКМ_ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад;
			Стр.ВКМ_ДатаНачала = НачалоМесяца(ВКМ_Период);
			Стр.ВКМ_ДатаОкончания = КонецМесяца(ВКМ_Период);
		КонецЦикла;
	КонецЕсли;

	
	Для Каждого Стр из ВКМ_Начисления Цикл 
		Если не ЗначениеЗаполнено(Стр.ВКМ_ДатаНачала) Тогда 
			Стр.ДатаНачала = НачалоМесяца(Дата);
		КонецЕсли;
		Если не ЗначениеЗаполнено(Стр.ВКМ_ДатаОкончания) Тогда 
			Стр.ДатаОкончания = КонецМесяца(Дата);
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры



//Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт
//
//  НепроверяемыеРеквизиты = Новый Массив();
//	
//  // Значение реквизита не должно быть пустым
//    НепроверяемыеРеквизиты.Добавить("ВКМ_Период"); 
//  
//   Если ВКМ_КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.ВКМ_Специалисты 
//    и не ЗначениеЗаполнено(ВКМ_ПроцентОтРабот)     Тогда
//    Сообщение = Новый СообщениеПользователю();
//    Сообщение.Текст = НСтр("ru = 'Заполните процент.'");
//    Сообщение.Поле = "ВКМ_ПроцентОтРабот";
//    Сообщение.УстановитьДанные(ЭтотОбъект);
//    Сообщение.Сообщить();
//    Отказ = Истина; 
//  КонецЕсли;
//
//  Если ВКМ_КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.ВКМ_АдминистративныйПерсонал
//  и ЗначениеЗаполнено(ВКМ_ПроцентОтРабот) Тогда
//	    Сообщение = Новый СообщениеПользователю();
//	    Сообщение.Текст = НСтр("ru = 'Сотрудник отноится к категории административного персонала. Процент не должен быть установлен отличным от 0'");
//	    Сообщение.Поле = "ВКМ_ПроцентОтРабот";
//	    Сообщение.УстановитьДанные(ЭтотОбъект);
//	    Сообщение.Сообщить();
//	    Отказ = Истина;     	
//  КонецЕсли;
// 
//  ВКМ_ОбщийМодульВызовСервера.ВКМ_УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура ВКМ_СформироватьДвиженияОсновныеНачисления()
	
	Если ВКМ_Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НачислениеЗарплатыНачисления.ВКМ_Сотрудник КАК Сотрудник,
	|	НачислениеЗарплатыНачисления.ВКМ_ВидРасчета КАК ВидРасчета,
	|	НачислениеЗарплатыНачисления.ВКМ_ДатаНачала КАК ДатаНачала,
	|	НачислениеЗарплатыНачисления.ВКМ_ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_ДанныеДокумента
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.ВКМ_Начисления КАК НачислениеЗарплатыНачисления
	|ГДЕ
	|	НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	|	И НачислениеЗарплатыНачисления.ВКМ_ВидРасчета В (ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад), ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОСотрудникахСрезПоследних.Период КАК Период,
	|	СведенияОСотрудникахСрезПоследних.ВКМ_Сотрудник КАК Сотрудник,
	|	СведенияОСотрудникахСрезПоследних.ВКМ_Оклад КАК Показатель,
	|	СведенияОСотрудникахСрезПоследних.ВКМ_ГрафикРаботы КАК ГрафикРаботы
	|ПОМЕСТИТЬ ВТГрафикиОклады
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|			&ПериодРасчета,
	|			ВКМ_Оклад > 0
	|				И (ВКМ_Сотрудник) В
	|					(ВЫБРАТЬ
	|						ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
	|						
	|					ИЗ
	|						ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК СведенияОСотрудникахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДокумента.Сотрудник КАК ВКМ_Сотрудник,
	|	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
	|	ВТ_ДанныеДокумента.ДатаНачала КАК ДатаНачала,
	|	ВТ_ДанныеДокумента.ДатаОкончания КАК ДатаОкончания,
	|	ВТГрафикиОклады.Показатель КАК Показатель,
	|	ВТГрафикиОклады.ГрафикРаботы КАК ВКМ_ГрафикРаботы
	|ИЗ
	|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТГрафикиОклады КАК ВТГрафикиОклады
	|		ПО ВТ_ДанныеДокумента.Сотрудник = ВТГрафикиОклады.Сотрудник
	|			";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПериодРасчета", НачалоМесяца(ВКМ_Период));
	
	РезВыполнения =Запрос.Выполнить(); 
	Выборка = РезВыполнения.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = НачалоМесяца(ВКМ_Период);
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.ВидРасчета = Выборка.ВидРасчета; 
		Движение.ПериодДействияНачало = Выборка.ДатаНачала;
		Движение.ПериодДействияКонец = Выборка.ДатаОкончания;
		Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -1));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ВКМ_СформироватьСторноЗаписи()
	
	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	
	Для Каждого Запись Из СторноЗаписи Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.ПериодРегистрации = ВКМ_Период;
		Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
		//Движение.Сумма = 0;
		//Движение.ЧасовОтработано = 0;
		Движение.Сторно = Истина;
		Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -1));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры



Процедура ВКМ_СформироватьДвиженияУдержания()
	
	Если ВКМ_Начисления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ различные
	|	НачислениеЗарплатыНачисления.ВКМ_Сотрудник КАК ВКМ_Сотрудник
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.ВКМ_Начисления КАК НачислениеЗарплатыНачисления
	|ГДЕ
	|	НачислениеЗарплатыНачисления.Ссылка = &Ссылка
	|			";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезВыполнения =Запрос.Выполнить(); 
	Выборка = РезВыполнения.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = НачалоМесяца(ВКМ_Период);
		Движение.ВКМ_Сотрудник = Выборка.ВКМ_Сотрудник; 
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ; 
		Движение.ПериодДействияНачало = НачалоМесяца(ВКМ_Период);
		Движение.ПериодДействияКонец = КонецМесяца(ВКМ_Период);
			Движение.БазовыйПериодНачало = Движение.ПериодДействияНачало;
			Движение.БазовыйПериодКонец = Движение.ПериодДействияКонец;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВКМ_СформироватьСторноЗаписиДвиженияУдержания()
	
	СторноЗаписи = Движения.ВКМ_Удержания.ПолучитьДополнение();
	
	Для Каждого Запись Из СторноЗаписи Цикл
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.ПериодРегистрации = ВКМ_Период;
		Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
		Движение.Сторно = Истина;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ВКМ_РасчитатьОклад()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
	|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
	|	ОсновныеНачисленияДанныеГрафика.ВКМ_ГрафикРаботы КАК ГрафикРаботы,
	|	ОсновныеНачисленияДанныеГрафика.ВКМ_Сотрудник КАК Сотрудник,
	|	ОсновныеНачисленияДанныеГрафика.ПериодРегистрации КАК ПериодРегистрации,
	|	ОсновныеНачисленияДанныеГрафика.ПериодДействия КАК ПериодДействия,
	|	ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ОсновныеНачисленияДанныеГрафика.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ОсновныеНачисленияДанныеГрафика.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ОсновныеНачисленияДанныеГрафика.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	ОсновныеНачисленияДанныеГрафика.Сторно КАК Сторно
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад)
	|	И Регистратор = &Ссылка) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатВыполнения = Запрос.Выполнить();
	Выборка = РезультатВыполнения.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Сумма = ?(ЗначениеЗаполнено(Выборка.План),Движение.Показатель * Выборка.Факт / Выборка.План,0);  
		Движение.Результат = Сумма; 
		Движение.ДнейОтработано = Выборка.Факт;
		
		Если Движение.Сторно Тогда
			Движение.Результат = - Движение.Результат;
			Движение.ДнейОтработано = - Движение.ДнейОтработано;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
	
КонецПроцедуры


Процедура ВКМ_РасчитатьПроцент()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_ЧасовКОплатеОборот) КАК Показатель,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_Сотрудник,
		|	СУММА(ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_СуммаКОплатеОборот) КАК Результат,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Период
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ДтНач, &ДтКон, День,) КАК
		|		ВКМ_ВыполненныеСотрудникомРаботыОбороты
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.ВКМ_Сотрудник,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Период";
	
	Запрос.УстановитьПараметр("ДтНач", НачалоМесяца(ВКМ_Период));
	Запрос.УстановитьПараметр("ДтКон", КонецМесяца(ВКМ_Период));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВДЗ = РезультатЗапроса.Выбрать();
	

	
	Пока ВДЗ.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = НачалоМесяца(ВКМ_Период);
		ЗаполнитьЗначенияСвойств(Движение, ВДЗ);
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Процент;//ВДЗ.ВидРасчета; 
		Движение.ПериодДействияНачало = ВДЗ.Период;
		Движение.ПериодДействияКонец = ВДЗ.Период;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	
КонецПроцедуры




Процедура ВКМ_РассчитатьОтпуск()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ПериодРегистрации КАК ПериодРегистрации,
	|	ОсновныеНачисленияБазаОсновныеНачисления.Регистратор КАК Регистратор,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ПериодДействия КАК ПериодДействия,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ОсновныеНачисленияБазаОсновныеНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	ОсновныеНачисленияБазаОсновныеНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	ОсновныеНачисленияБазаОсновныеНачисления.Активность КАК Активность,
	|	ОсновныеНачисленияБазаОсновныеНачисления.Сторно КАК Сторно,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ВКМ_Сотрудник КАК Сотрудник,
	|	ОсновныеНачисленияБазаОсновныеНачисления.Результат КАК Результат,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ДнейОтработано КАК ДнейОтработано,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ВКМ_ГрафикРаботы КАК ГрафикРаботы,
	|	ОсновныеНачисленияБазаОсновныеНачисления.Показатель КАК Показатель,
	|	ОсновныеНачисленияБазаОсновныеНачисления.РезультатБаза КАК РезультатБаза,
	|	ОсновныеНачисленияБазаОсновныеНачисления.ДнейОтработаноБаза КАК ДнейОтработаноБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, ,
	|		Регистратор = &Ссылка
	|	И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпуск)) КАК
	|		ОсновныеНачисленияБазаОсновныеНачисления
	|ИТОГИ
	|	СУММА(РезультатБаза),
	|	СУММА(ДнейОтработаноБаза)
	|ПО
	|	НомерСтроки"; 
	
	Измерения = Новый Массив;				
	Измерения.Добавить("ВКМ_Сотрудник");
	
//	Разрезы = Новый Массив;
//	Разрезы.Добавить("ВКМ_Сотрудник");
		
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Измерения",Измерения); 
//	Запрос.УстановитьПараметр("Разрезы",Разрезы); 
	
	РезультатВыполнения = Запрос.Выполнить();
	Выборка = РезультатВыполнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий()  Цикл 
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки-1];  
		СуммаНачислений = 0;
		СуммаДней=0;
		ВыборкаДеталей = Выборка.Выбрать();
		Пока  ВыборкаДеталей.Следующий() Цикл
			
		Сумма =	ВыборкаДеталей.РезультатБаза;
		СуммаДней =  СуммаДней+ ВыборкаДеталей.ДнейОтработаноБаза;
		СуммаНачислений = СуммаНачислений + Сумма;
	КонецЦикла; 
		Среднедневные = ?(СуммаДней>0, СуммаНачислений / СуммаДней,0);
		ДнейОтпуска = 1+  (Движение.ПериодДействияКонец - Движение.ПериодДействияНачало)/(24*60*60) ;
		Движение.ДнейОтработано = ДнейОтпуска;
		Движение.Показатель = Среднедневные;
        Движение.Результат = ДнейОтпуска * Движение.Показатель;
	КонецЦикла;		
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура ВКМ_РассчитатьУдержаниеНДФЛ()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	База.НомерСтроки КАК НомерСтроки,
	|	База.ПериодРегистрации КАК ПериодРегистрации,
	|	База.Регистратор КАК Регистратор,
	|	База.ВидРасчета КАК ВидРасчета,
	|	База.БазовыйПериодНачало КАК БазовыйПериодНачало,
	|	База.БазовыйПериодКонец КАК БазовыйПериодКонец,
	|	База.Активность КАК Активность,
	|	База.Сторно КАК Сторно,
	|	База.ВКМ_Сотрудник КАК Сотрудник,
	|	База.Результат КАК Результат,
	|	База.РезультатБаза КАК РезультатБаза
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения, ,
	|		Регистратор = &Ссылка
	|	И ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ) ) КАК
	|		База
	|ИТОГИ
	|	СУММА(РезультатБаза)
	|ПО
	|	НомерСтроки"; 
	
	Измерения = Новый Массив;				
	Измерения.Добавить("ВКМ_Сотрудник");
	

	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Измерения",Измерения); 

	
	РезультатВыполнения = Запрос.Выполнить();
	
	Выборка = РезультатВыполнения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий()  Цикл 
		
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки-1];  
		СуммаНачислений = 0;
		ВыборкаДеталей = Выборка.Выбрать();
		Пока  ВыборкаДеталей.Следующий() Цикл
		Сумма =	ВыборкаДеталей.РезультатБаза;
		СуммаНачислений = СуммаНачислений + Сумма;
	КонецЦикла; 
        Движение.Результат = СуммаНачислений * 13 / 100;
	КонецЦикла;		
	Движения.ВКМ_Удержания.Записать(, Истина);
	
КонецПроцедуры


&Вместо("ОбработкаПроверкиЗаполнения")
Процедура ВКМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт

  НепроверяемыеРеквизиты = Новый Массив();

  // Значение реквизита не должно быть пустым
  Если НЕ ЗначениеЗаполнено(ВКМ_Период) Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Период не заполнен.'");
    Сообщение.Поле = "ВКМ_Период";
    Сообщение.УстановитьДанные(ЭтотОбъект);
    Сообщение.Сообщить();
    Отказ = Истина; 
    НепроверяемыеРеквизиты.Добавить("ВКМ_Период"); 

  КонецЕсли;
  ВКМ_ОбщийМодульВызовСервера.ВКМ_УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры

#КонецОбласти

#КонецЕсли