Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудников из ВКМ_СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия;
		Движение.ПериодРегистрации = НачалоМесяца(ВКМ_Период);
		Движение.БазовыйПериодНачало = НачалоМесяца(ВКМ_Период);
		Движение.БазовыйПериодКонец = КонецМесяца(ВКМ_Период);
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудников.ВКМ_Сотрудник;
		Движение.Результат = ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии;
	КонецЦикла;

	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудников из ВКМ_СписокСотрудников Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
		Движение.ПериодРегистрации = ВКМ_Период;
		Движение.БазовыйПериодНачало = НачалоМесяца(ВКМ_Период);
		Движение.БазовыйПериодКонец = КонецМесяца(ВКМ_Период);
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудников.ВКМ_Сотрудник;
		Движение.Результат = ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии * 13 / 100;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры