#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудников Из ВКМ_СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ВКМ_Премия;
		Движение.ПериодРегистрации = НачалоМесяца(ВКМ_Период);
		Движение.БазовыйПериодНачало = НачалоМесяца(ВКМ_Период);
		Движение.БазовыйПериодКонец = КонецМесяца(ВКМ_Период);
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудников.ВКМ_Сотрудник;
		Движение.Результат = ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии;
	КонецЦикла;

	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудников Из ВКМ_СписокСотрудников Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ;
		Движение.ПериодРегистрации = ВКМ_Период;
		Движение.БазовыйПериодНачало = НачалоМесяца(ВКМ_Период);
		Движение.БазовыйПериодКонец = КонецМесяца(ВКМ_Период);
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудников.ВКМ_Сотрудник;
		Движение.Результат = ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии * 13 / 100;
	КонецЦикла;

	// регистр ВКМ_ВзаиморасчетыССотрудниками 

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Начисления.ВКМ_Сотрудник КАК Сотрудник,
	|	Начисления.Результат КАК Результат,
	|	Начисления.ВидРасчета КАК ВидРасчета,
	|	Начисления.ПериодРегистрации КАК ПериодРегистрации
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Начисления
	|ГДЕ
	|	Начисления.Регистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_Удержания.ВКМ_Сотрудник,
	|	ВКМ_Удержания.Результат*(-1) ,
	|	ВКМ_Удержания.ВидРасчета,
	|	ВКМ_Удержания.ПериодРегистрации
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ПериодРегистрации КАК ПериодРегистрации,
	|	ВТ.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ.Результат) КАК Результат
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.ПериодРегистрации,
	|	ВТ.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = ВыборкаДетальныеЗаписи.ПериодРегистрации;
			Движение.ВКМ_Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Движение.ВКМ_Сумма = ВыборкаДетальныеЗаписи.Результат;
		КонецЦикла;
	КонецЕсли;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли