
#Область ОбработчикиКомандФормы





&НаКлиенте
Процедура СоздатьАктыЗаМесяц(Команда)
	Если Не ЗначениеЗаполнено(Организация) или не ЗначениеЗаполнено(Месяц)
	Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните параметры обработки",,"ПараметрыСозданияАктов");
		Возврат;
	КонецЕсли;
	
	// для отладки ВызыватьСинхр();
	
	ДлитОпер = СоздатьАктыЗаМесяцНаСервере();
	 
	ПарамОжидан = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПарамОжидан.Интервал = 1;
	ПарамОжидан.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещЗаверш = Новый ОписаниеОповещения("ОбработкаЗавершенияСоздатьАктыЗаМесяц", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлитОпер, ОповещЗаверш, ПарамОжидан);


	//ОбновитьОтображениеДанных
	Элементы.ТДоговоры.Обновить();	
	Элементы.ТРТУ.Обновить();	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВызыватьСинхр()
	СПараметры = Новый Структура;
	СПараметры.Вставить("Месяц",Месяц );
	СПараметры.Вставить("Организация",Организация );
	Рез = Обработки.ВКМ_МассовоеСозданиеАктов.ВКМ_ДлительноеМассовоеСозданиеАктовРТУ(СПараметры);
	ОбработкаЗавершенияОтобразитьНаФормеАктыЗаМесяцНаСервере(Рез);
КонецПроцедуры


&НаСервере
Функция СоздатьАктыЗаМесяцНаСервере()
	СПараметры = Новый Структура;
	СПараметры.Вставить("Месяц",Месяц );
	СПараметры.Вставить("Организация",Организация );
	
	ДлитОпер= ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
	"Обработки.ВКМ_МассовоеСозданиеАктов.ВКМ_ДлительноеМассовоеСозданиеАктовРТУ",СПараметры );
	
	Возврат ДлитОпер;
КонецФункции

&НаКлиенте
Процедура  ОбработкаЗавершенияСоздатьАктыЗаМесяц(Результат, ДопПараметры) Экспорт
 Если Результат.Статус = "Выполнено" Тогда
 	ОбработкаЗавершенияСоздатьАктыЗаМесяцНаСервере(Результат.АдресРезультата);
 	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаЗавершенияСоздатьАктыЗаМесяцНаСервере(АдресРезультата)
	Рез = ПолучитьИзВременногоХранилища(АдресРезультата);
	ОбработкаЗавершенияОтобразитьНаФормеАктыЗаМесяцНаСервере(Рез);
КонецПроцедуры 

&НаСервере
Процедура ОбработкаЗавершенияОтобразитьНаФормеАктыЗаМесяцНаСервере(ДоговорыИАкты)
		ТДоговоры.Очистить();
	Для Каждого Дог из ДоговорыИАкты.МДоговоры цикл
		Стр = ТДоговоры.Добавить();
		Стр.Договор = Дог;
		Стр.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Дог,"Владелец" );
		КонецЦикла;
	
		ТРТУ.Очистить();
	Для Каждого РТУ из ДоговорыИАкты.МРТУ цикл
		Стр = ТРТУ.Добавить();
		Стр.Акты = РТУ;
		КонецЦикла;
КонецПроцедуры 
#КонецОбласти