#Область СлужебныеПроцедурыИФункции

Функция ВКМ_СуммаПрописью(Сумма) Экспорт
	СуммаРубли = Цел(Сумма);
    СуммаКопейки = (Сумма - СуммаРубли);
    
    РублиЧислом     = Формат(СуммаРубли, "ЧДЦ=0; ЧГ=0");
    РублиПрописью   = ЧислоПрописью(СуммаРубли, "Л = ru_RU; НД = Ложь", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 0");
    КопейкиПрописью = Сред(ЧислоПрописью(СуммаКопейки, "Л = ru_RU; НП = Ложь", ",,,, копейка, копейки, копеек, ж, 2"), 6);
    
    СуммаПрописью = РублиЧислом + " (" + РублиПрописью + ") " + КопейкиПрописью;
	
	Возврат СуммаПрописью;
КонецФункции


#КонецОбласти