#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ОбработкаПроведения(Отказ, Режим)
		//% сотрудника
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ВКМ_ПроцентОтРабот
			|ИЗ
			|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, ВКМ_Сотрудник = &Сотрудник) КАК
			|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
		
		Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
		Запрос.УстановитьПараметр("Дата", Дата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВДЗ = РезультатЗапроса.Выбрать();
		
		Если ВДЗ.Следующий() Тогда
			Процент = ВДЗ.ВКМ_ПроцентОтРабот;
		Иначе
			Сообщ = СтрШаблон("Для специалиста %1 на дату %2 не установлен процент от оплаты клиента. Установите."
								,Строка(ВКМ_Специалист),Формат(Дата,"ДФ=dd.MM.yyyy;"));
			ОбщегоНазначения.СообщитьПользователю(Сообщ);
			Отказ= Истина;
			Возврат;
		КонецЕсли;


	РеквДогов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВКМ_Договор,
		"ВКМ_СтоимостьЧасаРаботыСпециалиста,ВКМ_ДатаНачалаДоговораОбслуживания,ВКМ_ДатаОкончанияДоговораОбслуживания");
	Если НЕ(РеквДогов.ВКМ_ДатаНачалаДоговораОбслуживания <= Дата И РеквДогов.ВКМ_ДатаОкончанияДоговораОбслуживания
		>= НачалоДня(Дата)) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			"Дата документа за пределами периода действия указанного договора. Проведение отменено.");
		Возврат;
	КонецЕсли;
	
	СтавкаЧасаКлиента  = РеквДогов.ВКМ_СтоимостьЧасаРаботыСпециалиста;
		// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		
		
		// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	
	Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы Из ВКМ_ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Организация = ВКМ_Организация;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_ЧасыКОплатеКлиенту = Час(ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту) + (Минута(
			ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту) / 60);
		Движение.ВКМ_СуммаКОплате = Движение.ВКМ_ЧасыКОплатеКлиенту * СтавкаЧасаКлиента ;


		Движение2 = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение2.Период = Дата;
		//Движение2.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение2.ВКМ_Сотрудник = ВКМ_Специалист;
		Движение2.ВКМ_ЧасовКОплате = Движение.ВКМ_ЧасыКОплатеКлиенту;
		Движение2.ВКМ_СуммаКОплате = Движение.ВКМ_СуммаКОплате*Процент/100;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#КонецЕсли