#Область СлужебныеПроцедурыИФункции
Функция ОтправитьВгруппуТелеграм(ТекстСообщения) Экспорт
	// устанавливаем соединение с сервером
	Попытка
		//ЗащищСоедин = Новый ЗащищенноеСоединениеOpenSSL();
		//Соедин = Новый HTTPСоединение("api.telegram.org", , , , , ,ЗащищСоедин);
		Соедин = Новый HTTPСоединение("api.telegram.org", , , , , Истина);
		Соедин.Таймаут = 60;
		АдресРесурса = СтрШаблон("/bot%1/sendMessage", Строка(Константы.ВКМ_botToken.Получить()));
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");

		Тело = Новый Структура;
		ИДгруппыТГ = Константы.ВКМ_chat_id.Получить();
		Тело.Вставить("chat_id", ИДгруппыТГ);
		Тело.Вставить("text", ТекстСообщения);
		ТелоJSON = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(Тело);
		Запр = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		Запр.УстановитьТелоИзСтроки(ТелоJSON);
	
	//@skip-check bsl-legacy-check-dynamic-feature-access
		Ответ = Соедин.ОтправитьДляОбработки(Запр);
		Если Ответ.КодСостояния <> 200 Тогда
			ВызватьИсключение СтрШаблон(" Ошибка получения ответа на запрос %1  в группу ТГ %2 ", АдресРесурса, Строка(
				ИДгруппыТГ));
		КонецЕсли;
	Исключение
		ОшОп = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	ЗаписьЖурналаРегистрации(НСтр("ru = 'ОтправитьВгруппуТелеграм'"), УровеньЖурналаРегистрации.Ошибка, , , НСтр(
			"ru = 'Во время выполнения действия произошла ошибка.'") + Символы.ПС
			+ ОшОп );
			Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

Процедура УстановитьНачальныеЗначенияКонстантДляТелеграм() Экспорт
	Если Не ЗначениеЗаполнено(Константы.ВКМ_chat_id.Получить()) Тогда
	Константы.ВКМ_chat_id.Установить(-1003217169101);
КонецЕсли;

Если Не ЗначениеЗаполнено(Константы.ВКМ_botToken.Получить()) Тогда
	Константы.ВКМ_botToken.Установить("8544905372:AAE5XyP97ZYigMN96QrvUWw1QHFpVKfAT-Q");
	КонецЕсли;
КонецПроцедуры


Процедура ВКМ_ОтправкаУведомленийТелеграм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка,
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.ВКМ_ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки
		|ГДЕ
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.ПометкаУдаления <> ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВДЗ = РезультатЗапроса.Выбрать();
	
	Пока ВДЗ.Следующий() Цикл
			Если ОтправитьВгруппуТелеграм(ВДЗ.ВКМ_ТекстСообщения) Тогда //при успешной отправке удалить элемент
				Объе = ВДЗ.Ссылка.ПолучитьОбъект();
				Объе.УстановитьПометкуУдаления(Истина);
			КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры
#КонецОбласти