#Область Обработчикисобытий
#Если НаСервере Тогда

Процедура ОбработкаПроведения(Отказ, Режим)

	СтоимостьЧаса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботыСпециалиста");
		// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы Из ВКМ_ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Организация = ВКМ_Организация;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_ЧасыКОплатеКлиенту = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту;
		Движение.ВКМ_СуммаКОплате = (Час(ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту)
									+(Минута(ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту)/60)) 
									* СтоимостьЧаса;
	КонецЦикла;
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Проверить изменения даты, времени или специалиста
	УведомитьТБота = "";
	Если Не ЭтоНовый() Тогда 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	Документ1.Дата,
		|	Документ1.ВКМ_Специалист,
		|	Документ1.ВКМ_ДатаПроведенияРабот,
		|	Документ1.ВКМ_ВремяНачалаРаботПлан,
		|	Документ1.ВКМ_ВремяОкончанияРаботПлан
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиентов КАК Документ1
		|ГДЕ
		|	Документ1.Ссылка = &Ссылка"; 

		Запрос.УстановитьПараметр("Ссылка", Ссылка); 

		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Если Выборка.Следующий() Тогда 
			Если ВКМ_Специалист <> Выборка.ВКМ_Специалист Тогда
					ИзменСпец = СтрШаблон("Изменен специалист %1 на %2.",Строка(Выборка.ВКМ_Специалист),Строка(ВКМ_Специалист));	
			Иначе
				ИзменСпец = "";
			КонецЕсли;
			 Если 	ВКМ_ДатаПроведенияРабот <> Выборка.ВКМ_ДатаПроведенияРабот Тогда
					ИзменДт = СтрШаблон("Изменена дата работ %1 на %2.",формат(Выборка.ВКМ_ДатаПроведенияРабот,"ДФ=dd.MM.yy;"),формат(ВКМ_ДатаПроведенияРабот,"ДФ=dd.MM.yy;"));	
			Иначе
				ИзменДт = "";
			 КонецЕсли;
			 
	 Если 	ВКМ_ВремяНачалаРаботПлан <> Выборка.ВКМ_ВремяНачалаРаботПлан Тогда
				ИзменВр = СтрШаблон("Изменено время работ  %1 на %2.",формат(Выборка.ВКМ_ВремяНачалаРаботПлан,"ДФ=ЧЧ:мм;"),формат(ВКМ_ВремяНачалаРаботПлан,"ДФ=ЧЧ:мм;"));	
			Иначе
				ИзменВр = "";
			 КонецЕсли;				
		
		Если ЗначениеЗаполнено(ИзменСпец) или ЗначениеЗаполнено(ИзменДт) или ЗначениеЗаполнено(ИзменВр) Тогда
			УведомитьТБота = СтрШаблон("Изменена работа у клиента %1. %2 %3 %4",ВКМ_Клиент,ИзменСпец,ИзменДт,ИзменВр);
		КонецЕсли;
		
		КонецЕсли; 
	Иначе
		УведомитьТБота = СтрШаблон("Навая работа у клиента %1. Специалис %2, Дата %3, Время %4",ВКМ_Клиент,ВКМ_Специалист,ВКМ_ДатаПроведенияРабот,ВКМ_ВремяНачалаРаботПлан);
	КонецЕсли; 

	Если ЗначениеЗаполнено(УведомитьТБота) Тогда 
		НовУвед = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.СоздатьЭлемент();
		НовУвед.ВКМ_ТекстСообщения = УведомитьТБота;
		НовУвед.Записать();
		ВКМ_ТелеграмВызовСервера.ОтправитьВгруппуТелеграм(УведомитьТБота);
	КонецЕсли; 

КонецПроцедуры 

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли




#КонецОбласти