
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьОстатками(Команда)
	Записать();
	ЗаполнитьОстаткамиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОстаткамиНаСервере()
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник как ВКМ_Сотрудник,
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток) КАК ВКМ_Сумма
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник
	|ИМЕЮЩИЕ
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток) > 0";

//@skip-check module-structure-init-code-in-region
//Запрос.УстановитьПараметр("Дата", Новый МоментВремени(Объект.Дата,Объект.Ссылка));

РезультатЗапроса = Запрос.Выполнить();

ВДЗ = РезультатЗапроса.Выбрать();
Объект.ВКМ_Выплаты.Очистить();

Если ВДЗ.Количество()>0 Тогда

	Пока ВДЗ.Следующий() Цикл
		Стр = Объект.ВКМ_Выплаты.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, ВДЗ);
	КонецЦикла;
КонецЕсли;
	
КонецПроцедуры

#КонецОбласти