#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий



&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ВКМ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Ответственный = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
#Вставка
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ВКМ_ЗаполнитьНаОснованииСтруктуры(ДанныеЗаполнения);
	КонецЕсли;
#КонецВставки
КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения") 
Процедура ВКМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт

  НепроверяемыеРеквизиты = Новый Массив();

  // Значение реквизита не должно быть пустым
  Если НЕ ЗначениеЗаполнено(Организация) Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Организация не заполнена.'");
    Сообщение.Поле = "Организация";
    Сообщение.УстановитьДанные(ЭтотОбъект);
    Сообщение.Сообщить();
    Отказ = Истина; 
    НепроверяемыеРеквизиты.Добавить("Организация"); 
  КонецЕсли;
  // Значение реквизита не должно быть пустым
  Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Контрагент не заполнен.'");
    Сообщение.Поле = "Контрагент";
    Сообщение.УстановитьДанные(ЭтотОбъект);
    Сообщение.Сообщить();
    Отказ = Истина; 
    НепроверяемыеРеквизиты.Добавить("Контрагент"); 
  КонецЕсли;
  // Значение реквизита не должно быть пустым
  Если НЕ ЗначениеЗаполнено(Договор) Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Договор не заполнен.'");
    Сообщение.Поле = "Договор";
    Сообщение.УстановитьДанные(ЭтотОбъект);
    Сообщение.Сообщить();
    Отказ = Истина; 
    НепроверяемыеРеквизиты.Добавить("Договор"); 
  КонецЕсли;
  // Значение реквизита не должно быть пустым
//  Если Товары.Количество()=0 и Услуги.Количество()=0 Тогда
//    Сообщение = Новый СообщениеПользователю();
//    Сообщение.Текст = НСтр("ru = 'Не заполнены ни Товары, ни Услуги.'");
//   Сообщение.Сообщить();
//    Отказ = Истина; 
//    НепроверяемыеРеквизиты.Добавить("Товары"); 
//    НепроверяемыеРеквизиты.Добавить("Услуги"); 
//  КонецЕсли;


 
  ВКМ_ОбщийМодульВызовСервера.ВКМ_УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ВКМ_ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;

	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
#Вставка
	// регистр ВКМ_АктыРеализацииУслуг
	Движения.ВКМ_АктыРеализацииУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаУслуги из Услуги Цикл
		Движение = Движения.ВКМ_АктыРеализацииУслуг.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаУслуги.Номенклатура;
		Движение.Договор = Договор;
		Движение.Сумма = ТекСтрокаУслуги.Сумма;
	КонецЦикла;
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
#КонецВставки
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


//Процедура ВКМ_УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт
//
//  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
// 
//    // перед удалением реквизита из массива необходимо проверить, что он там есть
//    // (не был удален ранее платформой или в коде).
//    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
//    Если ПорядковыйНомер <> Неопределено Тогда
//      МассивРеквизитов.Удалить(ПорядковыйНомер);
//    КонецЕсли;
// 
//  КонецЦикла;
// 
//КонецПроцедуры

Процедура ВКМ_ЗаполнитьНаОснованииСтруктуры(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения );
КонецПроцедуры


Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт
	СообщОш ="";
//получит номенклатуру из констант НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста, 
//если хотя бы одна не заполнена, необходимо выдать ошибку и прекратить выполнение процедуры,
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		СообщОш = СокрЛП(СтрШаблон("%1 %2", СообщОш, "Не заполнена константа НоменклатураАбонентскаяПлата."));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		СообщОш = СокрЛП(СтрШаблон("%1 %2", СообщОш, "Не заполнена константа НоменклатураРаботыСпециалиста."));
	КонецЕсли;
	Если ЗначениеЗаполнено(СообщОш) Тогда
		СообщОш = СтрШаблон("%1 %2", СообщОш, "Обработка отменена.");
		ОбщегоНазначения.СообщитьПользователю(СообщОш);
		Возврат;
	КонецЕсли;
//
//очистит табличную часть.
	Услуги.Очистить();




	СтруДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
		"ВидДоговора,ВКМ_СуммаЕжемесячнойАбонентскойПлаты,ВКМ_СтоимостьЧасаРаботыСпециалиста,ВКМ_ДатаНачалаДоговораОбслуживания,ВКМ_ДатаОкончанияДоговораОбслуживания");
	Если СтруДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
//Если в договоре ненулевая сумма абонентской платы, добавьте в табличную часть строку с номенклатурой 
//из константы НоменклатураАбонентскаяПлата и суммой абонентской платы из договора.
		Если ЗначениеЗаполнено(СтруДоговора.ВКМ_СуммаЕжемесячнойАбонентскойПлаты) Тогда
			Стр = Услуги.Добавить();
			Стр.Номенклатура = НоменклатураАбонентскаяПлата;
			Стр.Количество = 1;
			Стр.Цена = СтруДоговора.ВКМ_СуммаЕжемесячнойАбонентскойПлаты;
			Стр.Сумма = Стр.Количество * Стр.Цена;
			Основание = Договор;
		КонецЕсли; 
//
//Если в месяц даты документа в регистре ВыполненныеКлиентуРаботы есть информация о выполненных работах 
//по этому договору, добавьте в табличную часть строку с номенклатурой из константы 
//НоменклатураРаботыСпециалиста и общим количеством и суммой из 
//регистра ВыполненныеКлиентуРаботы за месяц документа.

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_ЧасыКОплатеКлиентуПриход,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_СуммаКОплатеПриход
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(НАЧАЛОПЕРИОДА(&Дт, месяц), КОНЕЦПЕРИОДА(&Дт, месяц), Месяц,
		|		ВКМ_Организация = &Организация
		|	И ВКМ_Клиент = &Клиент
		|	И ВКМ_Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты";

		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("Дт", Дата);
		Запрос.УстановитьПараметр("Клиент", Контрагент);

		РезультатЗапроса = Запрос.Выполнить();

		ВДЗ = РезультатЗапроса.Выбрать();

		Если ВДЗ.Следующий() Тогда
			Рабт = Услуги.Добавить();
			Рабт.Номенклатура = НоменклатураРаботыСпециалиста;
			Рабт.Количество = ВДЗ.ВКМ_ЧасыКОплатеКлиентуПриход;
			Рабт.Сумма = ВДЗ.ВКМ_СуммаКОплатеПриход;
			Рабт.Цена = Рабт.Сумма / Рабт.Количество;
			Основание = Договор;
		КонецЕсли;

	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			"В документе договор вида не Абонентского обслуживания. Обработка отменена.");
	КонецЕсли;
	
	СуммаДокумента = Услуги.Итог("Сумма");
КонецПроцедуры

#КонецОбласти

#КонецЕсли