#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура ВКМ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Ответственный = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
#Вставка
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ВКМ_ЗаполнитьНаОснованииСтруктуры(ДанныеЗаполнения);
	КонецЕсли;
#КонецВставки
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ВКМ_ЗаполнитьНаОснованииСтруктуры(ДанныеЗаполнения)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения );
КонецПроцедуры


Процедура ВКМ_ВыполнитьАвтозаполнение() Экспорт
	СообщОш ="";
//получит номенклатуру из констант НоменклатураАбонентскаяПлата и НоменклатураРаботыСпециалиста, 
//если хотя бы одна не заполнена, необходимо выдать ошибку и прекратить выполнение процедуры,
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		СообщОш = СокрЛП(СтрШаблон("%1 %2", СообщОш, "Не заполнена константа НоменклатураАбонентскаяПлата."));
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		СообщОш = СокрЛП(СтрШаблон("%1 %2", СообщОш, "Не заполнена константа НоменклатураРаботыСпециалиста."));
	КонецЕсли;
	Если ЗначениеЗаполнено(СообщОш) Тогда
		СообщОш = СтрШаблон("%1 %2", СообщОш, "Обработка отменена.");
		ОбщегоНазначения.СообщитьПользователю(СообщОш);
		Возврат;
	КонецЕсли;
//
//очистит табличную часть.
	Услуги.Очистить();
//Найти действующий договор абонентского обслуживания 
//Запрос = Новый Запрос;
//Запрос.Текст =
//	"ВЫБРАТЬ
//	|	ДК.Ссылка,
//	|	ДК.ВКМ_ДатаНачалаДоговораОбслуживания,
//	|	ДК.ВКМ_ДатаОкончанияДоговораОбслуживания,
//	|	ДК.ВКМ_СуммаЕжемесячнойАбонентскойПлаты,
//	|	ДК.ВКМ_СтоимостьЧасаРаботыСпециалиста,
//	|	ДК.Организация,
//	|	ДК.ВидДоговора,
//	|	ДК.Владелец
//	|ИЗ
//	|	Справочник.ДоговорыКонтрагентов КАК ДК
//	|ГДЕ
//	|	ДК.Организация = &Организация
//	|	И ДК.ВидДоговора = &ВидДоговора
//	|	И ДК.Владелец = &Контрагент
//	|	И НАЧАЛОПЕРИОДА(ДК.ВКМ_ДатаНачалаДоговораОбслуживания, месяц) <= &Дт
//	|	И КОНЕЦПЕРИОДА(ДК.ВКМ_ДатаОкончанияДоговораОбслуживания, месяц) >= &Дт";
//
//Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
//Запрос.УстановитьПараметр("Организация", Организация);
//Запрос.УстановитьПараметр("Контрагент", Контрагент);
//Запрос.УстановитьПараметр("Дт", Дата);
//
//РезультатЗапроса = Запрос.Выполнить();
//
//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//
//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
//КонецЦикла;



	СтруДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
		"ВидДоговора,ВКМ_СуммаЕжемесячнойАбонентскойПлаты,ВКМ_СтоимостьЧасаРаботыСпециалиста,ВКМ_ДатаНачалаДоговораОбслуживания,ВКМ_ДатаОкончанияДоговораОбслуживания");
	Если СтруДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
//Если в договоре ненулевая сумма абонентской платы, добавьте в табличную часть строку с номенклатурой 
//из константы НоменклатураАбонентскаяПлата и суммой абонентской платы из договора.
		Если ЗначениеЗаполнено(СтруДоговора.ВКМ_СуммаЕжемесячнойАбонентскойПлаты) Тогда
			Стр = Услуги.Добавить();
			Стр.Номенклатура = НоменклатураАбонентскаяПлата;
			Стр.Количество = 1;
			Стр.Цена = СтруДоговора.ВКМ_СуммаЕжемесячнойАбонентскойПлаты;
			Стр.Сумма = Стр.Количество * Стр.Цена;
		КонецЕсли; 
//
//Если в месяц даты документа в регистре ВыполненныеКлиентуРаботы есть информация о выполненных работах 
//по этому договору, добавьте в табличную часть строку с номенклатурой из константы 
//НоменклатураРаботыСпециалиста и общим количеством и суммой из 
//регистра ВыполненныеКлиентуРаботы за месяц документа.

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_ЧасыКОплатеКлиентуПриход,
		|	ВКМ_ВыполненныеКлиентуРаботыОбороты.ВКМ_СуммаКОплатеПриход
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.Обороты(НАЧАЛОПЕРИОДА(&Дт, месяц), КОНЕЦПЕРИОДА(&Дт, месяц), Месяц,
		|		ВКМ_Организация = &Организация
		|	И ВКМ_Клиент = &Клиент
		|	И ВКМ_Договор = &Договор) КАК ВКМ_ВыполненныеКлиентуРаботыОбороты";

		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Договор", Договор);
		Запрос.УстановитьПараметр("Дт", Дата);
		Запрос.УстановитьПараметр("Клиент", Контрагент);

		РезультатЗапроса = Запрос.Выполнить();

		ВДЗ = РезультатЗапроса.Выбрать();

		Если ВДЗ.Следующий() Тогда
			Рабт = Услуги.Добавить();
			Рабт.Номенклатура = НоменклатураРаботыСпециалиста;
			Рабт.Количество = ВДЗ.ВКМ_ЧасыКОплатеКлиентуПриход;
			Рабт.Сумма = ВДЗ.ВКМ_СуммаКОплатеПриход;
			Рабт.Цена = Рабт.Сумма / Рабт.Количество;
		КонецЕсли;

	Иначе
		ОбщегоНазначения.СообщитьПользователю(
			"В документе договор виде не Абонентского обслуживания. Обработка отменена.");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли