#Область ОбработчикиСобытийФормы



&После("ПриСозданииНаСервере")
&НаСервере
Процедура ВКМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Добавить команду Заполнить
	КЗапол = Команды.Добавить("КомандаЗаполнить");
	КЗапол.Заголовок= "Заполнить абонентским обслуживанием";
	КЗапол.Действие = "ВКМ_ВыполнитьКомандаЗаполнить";
	
	КнЗапол = Элементы.Добавить("Заполнить",тип("КнопкаФормы"),КоманднаяПанель );
	КнЗапол.ИмяКоманды = "КомандаЗаполнить";
	КнЗапол.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
	//добавить в отбор договоров договоры обслуживания
	МВидыДогов = Новый Массив;
	МВидыДогов.Добавить(Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	МВидыДогов.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Покупатель);
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.ВидДоговора", МВидыДогов);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.Договор.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ВКМ_ВыполнитьКомандаЗаполнить(Команда)
	ВКМ_ВыполнитьКомандаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВыполнитьКомандаЗаполнитьНаСервере()
	ВидДог = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ВидДоговора" );
	Если ВидДог = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		ДокуменОбъект = РеквизитФормыВЗначение("Объект");
		ДокуменОбъект.ВКМ_ВыполнитьАвтозаполнение();
		КонецЕсли;
КонецПроцедуры

#КонецОбласти
