#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ВКМ_УсловияОплатыСотрудников .Записывать = Истина;
	Движение = Движения.ВКМ_УсловияОплатыСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Сотрудник;
	Движение.ВКМ_Оклад = ВКМ_Оклад;
	Движение.ВКМ_ПроцентОтРабот = ВКМ_ПроцентОтРабот;
	Движение.ВКМ_ГрафикРаботы = ВКМ_ГрафикРаботы;


	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ВКМ_УсловияОплатыСотрудников
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт

  НепроверяемыеРеквизиты = Новый Массив();
	
  // Значение реквизита не должно быть пустым
    НепроверяемыеРеквизиты.Добавить("ВКМ_ПроцентОтРабот"); 
  
   Если ВКМ_КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.ВКМ_Специалисты 
    и не ЗначениеЗаполнено(ВКМ_ПроцентОтРабот)     Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Заполните процент.'");
    Сообщение.Поле = "ВКМ_ПроцентОтРабот";0
    Сообщение.УстановитьДанные(ЭтотОбъект);
    Сообщение.Сообщить();
    Отказ = Истина; 
  КонецЕсли;
  
  Если ВКМ_КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.ВКМ_АдминистративныйПерсонал
  и ЗначениеЗаполнено(ВКМ_ПроцентОтРабот) Тогда
	    Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru = 'Сотрудник отноится к категории административного персонала. Процент не должен быть установлен отличным от 0'");
	    Сообщение.Поле = "ВКМ_ПроцентОтРабот";
	    Сообщение.УстановитьДанные(ЭтотОбъект);
	    Сообщение.Сообщить();
	    Отказ = Истина;     	
  КонецЕсли;
 
  ВКМ_ОбщийМодульВызовСервера.ВКМ_УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры

#КонецОбласти
#КонецЕсли