Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ВКМ_ПараметрыРасчетаЗПСотрудников
	Движения.ВКМ_ПараметрыРасчетаЗПСотрудников.Записывать = Истина;
	Движение = Движения.ВКМ_ПараметрыРасчетаЗПСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Сотрудник;
	Движение.ВКМ_Оклад = ВКМ_Оклад;
	Движение.ВКМ_Процент = ВКМ_Процент;
	Движение.ВКМ_ГрафикРаботы = ВКМ_ГрафикРаботы;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры