#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


//@skip-check change-and-validate-instead-of-around
//@skip-check module-structure-method-in-regions
//@skip-check doc-comment-parameter-section
&Вместо("ОбработкаПроверкиЗаполнения")
Процедура ВКМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) Экспорт

  НепроверяемыеРеквизиты = Новый Массив();
	
  // Значение реквизита не должно быть пустым
    НепроверяемыеРеквизиты.Добавить("ВКМ_ПроцентОтРабот"); 
  
   Если ВКМ_КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.ВКМ_Специалисты 
    и не ЗначениеЗаполнено(ВКМ_ПроцентОтРабот)     Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Заполните процент.'");
    Сообщение.Поле = "ВКМ_ПроцентОтРабот";
    Сообщение.УстановитьДанные(ЭтотОбъект);
    Сообщение.Сообщить();
    Отказ = Истина; 
  КонецЕсли;

  Если ВКМ_КатегорияСотрудника = Перечисления.ВКМ_КатегорияСотрудника.ВКМ_АдминистративныйПерсонал
  и ЗначениеЗаполнено(ВКМ_ПроцентОтРабот) Тогда
	    Сообщение = Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru = 'Сотрудник отноится к категории административного персонала. Процент не должен быть установлен отличным от 0'");
	    Сообщение.Поле = "ВКМ_ПроцентОтРабот";
	    Сообщение.УстановитьДанные(ЭтотОбъект);
	    Сообщение.Сообщить();
	    Отказ = Истина;     	
  КонецЕсли;
 
  ВКМ_ОбщийМодульВызовСервера.ВКМ_УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры

#КонецОбласти
#КонецЕсли